Project work versions/expression.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-10 niedz. 21:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Expression concept</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="C:/space/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Expression concept</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge1bf4c2">1. Intro</a>
<ul>
<li><a href="#orgdcc40c0">1.1. Problems</a>
<ul>
<li><a href="#org3aa334e">1.1.1. Scope viewing</a></li>
<li><a href="#orgc70f3f5">1.1.2. Declaration new functions</a></li>
<li><a href="#org5bd154a">1.1.3. Railway expression problem</a></li>
<li><a href="#org78d4999">1.1.4. Combinatory logic</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org85091bf">2. Math Expression</a>
<ul>
<li><a href="#org2b33535">2.1. <span class="todo TODO">TODO</span> Vector-list logic evaluation.</a></li>
</ul>
</li>
<li><a href="#orgd0a7926">3. SExpression</a></li>
<li><a href="#org00114f0">4. Existing DSL</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge1bf4c2" class="outline-2">
<h2 id="orge1bf4c2"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
Every N-dimension vector/array calulation system must allow evaluate math expression with [0..N] local language dimension specyficator. Mean it representation all aspect of linier math(mostly 90% needed apstraction, primitive calculation) argument's, covering only changed dimenstion data and muttable global(in scope of expression) variable and immutable konstants(in scope of exrepssion and scope of hole program). 
</p>
</div>
<div id="outline-container-orgdcc40c0" class="outline-3">
<h3 id="orgdcc40c0"><span class="section-number-3">1.1</span> Problems</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In this section discusing DSL-related implementation problem and strategies, which depend on problem and influes to end-side(mean: user) GUΙ and API interface. 
</p>
</div>

<div id="outline-container-org3aa334e" class="outline-4">
<h4 id="org3aa334e"><span class="section-number-4">1.1.1</span> Scope viewing</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Scope is also simple think wich must limit reference by AGΤ tree to variable and function stack. 
This concept create some limitation, for naming variables and functions, or changing naming stack model(mean changing for lexical scope).
</p>
</div>
</div>
<div id="outline-container-orgc70f3f5" class="outline-4">
<h4 id="orgc70f3f5"><span class="section-number-4">1.1.2</span> Declaration new functions</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Nothing to add. Functino must have expression like declaration, which being used for small lambdas and global functions.
</p>
</div>
</div>
<div id="outline-container-org5bd154a" class="outline-4">
<h4 id="org5bd154a"><span class="section-number-4">1.1.3</span> Railway expression problem</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
All calculation must have two state - <code>Nothing(?EMPTY_RESULT) | TypeContainer(RESULT)</code> . All middle functor evaluation of function must serving finish execution on <code>Nothing</code> result for every functor to functor change step.
This also mean that program must service the <code>Nothing</code> and <code>Nothing(RESULT)</code> for converting it to output into string swing component.
</p>
</div>
</div>
<div id="outline-container-org78d4999" class="outline-4">
<h4 id="org78d4999"><span class="section-number-4">1.1.4</span> Combinatory logic</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
All function must be simple and clear, and may allow to create closures and compositive lambdas on functor level.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org85091bf" class="outline-2">
<h2 id="org85091bf"><span class="section-number-2">2</span> Math Expression</h2>
<div class="outline-text-2" id="text-2">
<p>
Example of expression, influed by math expression notation. Ivention by me notation called FEXP(Flow Expression)
Sum columns in third columns
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #6272a4;"># </span><span style="color: #6272a4;">&lt;global scope variable&gt; = &lt;logic&gt;</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">$&lt;Number&gt; introspection columns</span>
$<span style="color: #f8f8f2; font-weight: bold;">3</span> = $<span style="color: #f8f8f2; font-weight: bold;">1</span> + $<span style="color: #f8f8f2; font-weight: bold;">2</span>
$<span style="color: #f8f8f2; font-weight: bold;">3</span> = Sum($<span style="color: #f8f8f2; font-weight: bold;">1</span>,$<span style="color: #f8f8f2; font-weight: bold;">2</span>)
$<span style="color: #f8f8f2; font-weight: bold;">3</span> = Multi(Sum($<span style="color: #f8f8f2; font-weight: bold;">1</span>,Pow($<span style="color: #f8f8f2; font-weight: bold;">2</span>,2)),4)
$<span style="color: #f8f8f2; font-weight: bold;">3</span> = $<span style="color: #f8f8f2; font-weight: bold;">4</span> = $<span style="color: #f8f8f2; font-weight: bold;">1</span> + $<span style="color: #f8f8f2; font-weight: bold;">2</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">@&lt;Number&gt; introspect rows</span>
@1$<span style="color: #f8f8f2; font-weight: bold;">3</span> = @1$<span style="color: #f8f8f2; font-weight: bold;">1</span> + @1$<span style="color: #f8f8f2; font-weight: bold;">2</span>
$:name_f_s = $:first_name + @1$:last_name
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">In column formula do the same without destionation argument</span>
$<span style="color: #f8f8f2; font-weight: bold;">1</span> + $<span style="color: #f8f8f2; font-weight: bold;">2</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">Var definition</span>
var = Sum(1,2)
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">Function definition</span>
<span style="color: #50fa7b; font-weight: bold;">MyFunc</span>(n,a) = Sum(n,a+2)
AnonimicFunc = (n,a) Sum(n,a+2)
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">Loops</span>
<span style="color: #50fa7b; font-weight: bold;">MyFunc</span>(n) = For(1..10,(n)Sum(n,1))
<span style="color: #50fa7b; font-weight: bold;">MyFunc</span>(n) = For(1..10,10..1,(n,x)Sum(n,x))
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">Conditions </span>
<span style="color: #50fa7b; font-weight: bold;">MyFunc</span>(n) = Eq(x,2) true&gt;3 false&gt;4 &gt;0
<span style="color: #50fa7b; font-weight: bold;">MyFunc</span>(n) = Random(10) 0&gt;<span style="color: #f1fa8c;">"A"</span> 1..9&gt;<span style="color: #f1fa8c;">"B"</span> &gt;<span style="color: #f1fa8c;">"D"</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">embading conditional operator</span>
<span style="color: #50fa7b; font-weight: bold;">MyFunc</span>(n) = Random(10) 0&gt;<span style="color: #f1fa8c;">"A"</span> 1..9&gt; ((a) Less(a,5) true&gt; <span style="color: #f1fa8c;">"B1"</span> &gt; <span style="color: #f1fa8c;">"B2"</span> ) &gt;<span style="color: #f1fa8c;">"D"</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">Composit functions in this tepe of expression</span>
<span style="color: #50fa7b; font-weight: bold;">MyCompositFunction</span>(n) = Composit(F2,F1)
<span style="color: #50fa7b; font-weight: bold;">MyCompositFunction</span>(n) = F2(F1(n))
<span style="color: #50fa7b; font-weight: bold;">MyCompositFunction</span>(n) = F1(n) | (e) F2(e)
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">what in other language call "multiline" functions</span>
<span style="color: #50fa7b; font-weight: bold;">Procedure</span>(n) = Sum(n,10) | (n) Minus(10,n) | (n) Eq(n,0) true&gt; <span style="color: #f1fa8c;">"YES"</span> false&gt; <span style="color: #f1fa8c;">"NO"</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">How it look in multiline</span>
<span style="color: #50fa7b; font-weight: bold;">Procedure</span>(n) = Sum(n,10) 
             | (n) Minus(10,n) 
             | (n) Eq(n,0) true&gt; <span style="color: #f1fa8c;">"YES"</span> 
                           false&gt; <span style="color: #f1fa8c;">"NO"</span>
</pre>
</div>
</div>
<div id="outline-container-org2b33535" class="outline-3">
<h3 id="org2b33535"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Vector-list logic evaluation.</h3>
</div>
</div>
<div id="outline-container-orgd0a7926" class="outline-2">
<h2 id="orgd0a7926"><span class="section-number-2">3</span> SExpression</h2>
<div class="outline-text-2" id="text-3">
<p>
Strongly and lispy example of DSL language, more in Lisp-1 way, otherwise clisp more complicated.
But i mean primitive version of scheme. Not like clojure, mach simplier
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #6272a4;">; </span><span style="color: #6272a4;">Just lisp, with realization of muttable functions</span>
def,defn,lambda,let,for,mapcar,car,cdr,&lt;arithmetic operations&gt;...
</pre>
</div>
</div>
</div>
<div id="outline-container-org00114f0" class="outline-2">
<h2 id="org00114f0"><span class="section-number-2">4</span> Existing DSL</h2>
<div class="outline-text-2" id="text-4">
<p>
Find alredy exist parser of simpliest math calculation and upgrade it
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-01-10 niedz. 21:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
